
* marmalade
#+BEGIN_SRC emacs-lisp
(require 'package)
(add-to-list 'package-archives 
             '("marmalade" . "https://marmalade-repo.org/packages/"))
; M-x package-refresh-contents [RET]
#+END_SRC

* enable melpa
#+BEGIN_SRC emacs-lisp
;; load emacs 24's package system. Add MELPA repository.
(when (>= emacs-major-version 24)
  (require 'package)
  (add-to-list
   'package-archives
   ;; '("melpa" . "http://stable.melpa.org/packages/") ; many packages won't show if using stable
   '("melpa" . "http://melpa.milkbox.net/packages/")
   t))
#+END_SRC

#+BEGIN_SRC emacs-lisp
(require 'package)
(add-to-list 'package-archives '("melpa" . "https://melpa.org/packages/"))
#+END_SRC

#+RESULTS:
: ((melpa . https://melpa.org/packages/) (gnu . https://elpa.gnu.org/packages/))


#+BEGIN_SRC emacs-lisp
(require 'package)
(add-to-list 'package-archives
             '("melpa-stable" . "https://stable.melpa.org/packages/"))

#+END_SRC

#+RESULTS:
: ((melpa-stable . https://stable.melpa.org/packages/) (melpa . https://melpa.org/packages/) (gnu . https://elpa.gnu.org/packages/))
